app/controllers/users_controller.rb

	def update
@user = User.find(params[:id])
  if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "ibtechrajnew"], ["password", "xxxxxxxx"], ["updated_at", "2019-07-16 16:07:24.917174"], ["id", 1]]